#СКОРЕЕ ВСЕГО ВЫ БУДЕТЕ ЭТО МЕНЯТЬ
#СКОРЕЕ ВСЕГО ВЫ БУДЕТЕ ЭТО МЕНЯТЬ
#СКОРЕЕ ВСЕГО ВЫ БУДЕТЕ ЭТО МЕНЯТЬ
#СКОРЕЕ ВСЕГО ВЫ БУДЕТЕ ЭТО МЕНЯТЬ
#СКОРЕЕ ВСЕГО ВЫ БУДЕТЕ ЭТО МЕНЯТЬ


#Сколько спать между аакками
sleep_b_accs = True #True / False, True если нужно спать между аккаунтами

sleep_accs_from = 10 #От
sleep_accs_to = 100 #До

#Сколько спать между активностями
sleep_b_activity = True #True / False, True если нужно спать между активностями

sleep_from_act = 10 #От
sleep_to_act = 40 #До



#ПРОЧИТАЙТЕ НО СКОРЕЕ ВСЕГО ВЫ НЕ БУДЕТЕ ЭТО МЕНЯТЬ.
#ПРОЧИТАЙТЕ НО СКОРЕЕ ВСЕГО ВЫ НЕ БУДЕТЕ ЭТО МЕНЯТЬ.
#ПРОЧИТАЙТЕ НО СКОРЕЕ ВСЕГО ВЫ НЕ БУДЕТЕ ЭТО МЕНЯТЬ.
#ПРОЧИТАЙТЕ НО СКОРЕЕ ВСЕГО ВЫ НЕ БУДЕТЕ ЭТО МЕНЯТЬ.
#ПРОЧИТАЙТЕ НО СКОРЕЕ ВСЕГО ВЫ НЕ БУДЕТЕ ЭТО МЕНЯТЬ.
#ПРОЧИТАЙТЕ НО СКОРЕЕ ВСЕГО ВЫ НЕ БУДЕТЕ ЭТО МЕНЯТЬ.


#RPC 
# Если не ебете че это и все работает исправно можно не трогать
node = 'https://rpc.goerli.eth.gateway.fm'

#Контракты 
reth_adres = '0x178E141a0E3b34152f73Ff610437A7bf9B83267A'
steth_adres = '0x1643E812aE58766192Cf7D2Cf9567dF2C37e9B7F'

reth_stake = '0x879944A8cB437a5f8061361f82A6d4EED59070b5'
steth_stake = '0xB613E78E2068d7489bb66419fB1cfa11275d14da'

#Процент от баланса в Rocketpool. Минимальный деп 0.01gETH. Меняйте ТОЛЬКО если у вас ЕБАНУТО БОЛЬШОЙ баланс.
percent_from_rp = 20
percent_to_rp = 50

#Процент от баланса в stETH. Меняйте ТОЛЬКО если у вас ЕБАНУТО БОЛЬШОЙ баланс.
percent_from_st = 20
percent_to_st = 40



text1 = '''
 ______     __  __     __     ______     __  __     ______     __  __     ______    
/\  ___\   /\ \_\ \   /\ \   /\___  \   /\ \/\ \   /\  __ \   /\ \/ /    /\  __ \   
\ \___  \  \ \  __ \  \ \ \  \/_/  /__  \ \ \_\ \  \ \ \/\ \  \ \  _"-.  \ \  __ \  
 \/\_____\  \ \_\ \_\  \ \_\   /\_____\  \ \_____\  \ \_____\  \ \_\ \_\  \ \_\ \_\ 
  \/_____/   \/_/\/_/   \/_/   \/_____/   \/_____/   \/_____/   \/_/\/_/   \/_/\/_/ 
  
                            | https://t.me/tripleshizu |
'''